package org.vakhrusheva.commands;

public class CommandsConfig {

  public static String getStartMessage() {
    return "Привет!\nЭто бот команды Инвагёрлс.\n"
        + "Я здесь для того, чтобы подарить вам набор поддерживающих стикеров "
        + "и добавить в чат поддержки для женщин с инвалидностью.\n\n"
        + "Представьтесь, пожалуйста\uD83D\uDC47";
  }

  public static String getHelpMessage() {
    return "Привет!\n\nЭто бот команды Инвагёрлс.\n\n"
        + "Я здесь для того, чтобы подарить вам набор поддерживающих стикеров "
        + "и добавить в чат поддержки для женщин с инвалидностью.\n\n"
        + "Для начала нашего общения нажми /start";
  }

  public static String getNotAgreedResponse() {
    return "Мы дарим вам набор поддерживающих стикеров!\n"
        + "Вы можете начать их использовать, нажав на эту ссылку:\n"
        + "https://t.me/addstickers/Invagirls\n\n"
        + "Спасибо за внимание к проекту, следите за анонсами!\n";
  }

  public static String getRules() {
    return "В ЧАТЕ ПРИВЕТСТВУЮТСЯ:\n"
        + "– слова поддержки, мотивирующие случаи из жизни, запрос на поддержку, поиск единомышленниц в своём городе;\n"
        + "–  Ссылки на научно обоснованные лекции и документальные материалы, публикации в СМИ для дальнейшего обсуждения;\n"
        + "– Анонсы мероприятий или объявления проходят через модераторку чата;\n"
        + "– Мы приветствуем комплименты участниц друг другу при условии, что комплименты адресованы к тому, к чему человек приложил усилия (прическа, костюм и прочее);\n"
        + "– Вне зависимости от ситуации, в нашем пространстве мы всегда на стороне пострадавшей;\n"
        + "\n"
        + "РЕКОМЕНДАЦИИ:\n"
        + "– Для спокойствия участниц чата перед публикацией по возможности прописывайте триггеры: физическое насилие, селфхарм, суицидальные мысли, сексуализированное насилие, психологическое насилие, абъюз, гомофобия, дискриминация, психофобия, эйблизм;\n"
        + "– По возможности добавляйте описание изображений, которыми вы делитесь;\n"
        + "– Если вы сомневаетесь в том, что ваши слова являются поддержкой, посмотрите наш материал по ссылке https://www.instagram.com/p/CVn-bLkLWWs/?utm_medium=copy_link;\n"
        + "\nПродолжить?";
  }

  public static String getWhatIsProhibited() {
    return "В ЧАТЕ ЗАПРЕЩЕНО:\n"
        + "– Рассказывать истории третьих лиц;\n"
        + "– Давать рекомендации медицинского характера;\n"
        + "– Навязывать советы;\n"
        + "– Осуждать и оскорблять участниц чата;\n"
        + "– Виктимблейминг — обвинение жертвы;\n"
        + "– Давать советы, нарушающие закон;\n"
        + "– Распространять ненаучные практики оздоровления;\n"
        + "\n"
        + "***\n"
        + "– Воздержитесь от дискриминирующих высказываний по любому признаку: по религии, внешности, сексуальности и т.д.\n"
        + "– Просим избегать позиции «белое пальто» — ваше мировоззрение и те блага, которыми вы обладаете, не обязательно есть у других,просим не использовать формулировки «я бы»;\n"
        + "– Избегайте сравнений в жизненных ситуациях: не приветствуются фразы: «А мои родственники хорошие», «А мои родители не такие», «А я думала у меня все плохо, а оказывается, нет»;\n"
        + "\n"
        + "***\n"
        + "– Любые авторские материалы, запощенные в чате — фото, сообщения, аудио — запрещается публиковать в других пространствах без запроса правообладательницы\n"
        + "– Мы не против феминитивов и не затеваем на этой площадке спор о них;\n"
        + "– Мы не придираемся к правилам правописания — у каждой разный уровень владения языком;\n"
        + "\n"
        + "***\n"
        + "– Если кто-то из участниц чата в личных сообщениях пишет вам оскорбления, угрозы или непрошеные советы, пожалуйста, обратитесь к модераторке, приложив скриншоты или другие источники."
        + "\nПродолжить?";
  }

  public static String getCare() {
    return "Мы заботимся о безопасности и комфорте каждой участницы чата. Мы не можем обеспечить полную защиту, но призываем максимально соблюдать правила, чтобы платформа развивалась как поддерживающее пространство."
            + "\n\nВы ознакомились с правилами и даете согласие следовать им?";
  }

  public static String getInvitation() {
    return "Чтобы вступить в чат пройдите по ссылке:\n\n"
        + "https://t.me/+8MJrvqGjwxJjYzNi\n\n"
        + "Также мы дарим вам набор поддерживающих стикеров, которые помогут вашему общению в чате!\n"
        + "Вы можете получить их, нажав на эту ссылку:\n"
        + "https://t.me/addstickers/Invagirls\n\n"
        + "Спасибо за внимание к проекту, следите за анонсами!";
  }

  public static String getUnder18Response() {
    return "Мы дарим вам набор поддерживающих стикеров!\n"
        + "Вы можете начать их использовать, нажав на эту ссылку:\n\n"
        + "https://t.me/addstickers/Invagirls\n\n"
        + "Спасибо за внимание к проекту, следите за анонсами!";
  }

  public static String getIntroduction() {
    return "Мы приглашаем вас вступить в чат поддержки Инвагёлс! Для этого, пожалуйста, ознакомьтесь с правилами общения в чате:\n"
        + "\n"
        + "ВАМ ДОЛЖНО БЫТЬ БОЛЬШЕ 18 ЛЕТ\n"
        + "\n"
        + "Вы находитесь в чате поддержки женщин с инвалидностью, созданном командой @invagirl.\n"
        + "\n"
        + "Чат сделан как платформа, на которой женщины с опытом инвалидности могут выразить свои чувства, рассказать свои истории, получить поддержку.\n"
        + "\n"
        + "Есть темы, на которые сложно или невозможно говорить с родственниками или близкими людьми. Мы понимаем важность возможности выговориться. Для  этого мы создали платформу чата поддержки.\n"
        + "Чтобы общение в чате было бережным и поддерживающим, мы вводим правила, которых просим придерживаться каждую участницу. При нарушении правил мы будем вынуждены исключить вас из чата или вынести предупреждение. После повторного нарушения мы также исключим вас."
        + "\n\n"
        + "Читать правила?";
  }

  public static String getAgree() {
    return "Согласны с правилами";
  }

  public static String getNotAgree() {
    return "Не согласны с правилами";
  }
}
